Repository: KL-7/numintegr
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: English
ru: Английский

source: Russian
ru: Русский

source: Left rectangles rule
ru: Правило левых прямоугольников

source: Approximate function f on subinterval [a, b] with constant a function equal to f(a) on [a, b].
ru: Аппроксимирует функцию f на интервале [a, b] постоянной функцией, равной f(a) на [a, b].

source: Right rectangles rule
ru: Правило правых прямоугольников

source: Approximate function f on subinterval [a, b] with constant a function equal to f(b) on [a, b].
ru: Аппроксимирует функцию f на интервале [a, b] постоянной функцией, равной f(b) на [a, b].

source: Inner rectangles rule
ru: Правило внутренних прямоугольников

source: Approximate function f on subinterval [a, b] with constant a function equal to f((a + b) / 2) on [a, b].
ru: Аппроксимирует функцию f на интервале [a, b] постоянной функцией, равное f((a + b) / 2) на [a, b].

source: Trapezoidal rule
ru: Правило трапеций

source: Approximate function f on subinterval [a, b] with a polynomial of degree 1 which passes through the points (a, f(a)) and (b, f(b)).
ru: Аппроксимирует функцию f на интервале [a, b] полиномом первой степени (линейной функцией), проходящим через точки (a, f(a)) и (b, f(b)).

source: Simpson's rule
ru: Правило Симпосна

source: Approximate function f on subinterval [a, b] with a polynomial of degree 2 which passes through the points (a, f(a)), ((a+b) /2, f((a+b) / 2)) and (b, f(b)).
ru: Аппроксимирует функцию f на интервале [a, b] полиномом второй степени, проходящим через точки (a, f(a)), ((a+b) /2, f((a+b) / 2)) и (b, f(b)).

source: Failed to parse the function
ru: Не удалось распарсить функцию

source: The function contains some undefined functions or variables
ru: Функция содержит неопределенные функции или переменные

source: The function is not defined on this interval
ru: Функция не определена на данном интервале

source: The function is not defined on this interval (zero division occured)
ru: Функция не определена на данном интервале (деление на ноль)

source: Sorry, integration failed for unknown reason
ru: Извините, интергирование завершилось неудачно по неизвестной причине

source: pi constant (3.14159)
ru: константа pi (3.14159)

source: e costant (2.71828)
ru: константа e (2.71828)

source: x raised to the power of y
ru: x в степени y

source: trigonometric cosine of x
ru: тригонометрический косинус x

source: trigonometric sine of x
ru: тригонометрический синус x

source: trigonometric tangent of x
ru: тригонометрический тангенс x

source: trigonometric cotangent of x
ru: тригонометрический котангенс x

source: arc cosine of x
ru: арккосинус x

source: arc sine of x
ru: арксинус x

source: arc tangent of x
ru: арктангенс x

source: arc cotangent of x
ru: арккотангенс x

source: hyperbolic cosine of x
ru: гипербоилческий косинус x

source: hyperbolic sine of x
ru: гиперболический синус x

source: hyperbolic tangent of x
ru: гиперболический тангенс x

source: hyperbolic cotangent of x
ru: гиперболический котангенс x

source: absolute value of x
ru: абсолютное значение x

source: e raised to the power of x
ru: e в степени x

source: logarithm of x to the given base
ru: логарифм x по основанию base

source: natural logarithm (base e) of x
ru: натуральный (по основанию e) логарифм x

source: base 10 logarithm of x
ru: десятичный логарифм x

source: square root of x
ru: корень из x

source: About
ru: О проекте

source: About the project
ru: О проекте

source: is a simple web-app for performing <a title="Numerical Integration article at Wikipedia.org" href="http://en.wikipedia.org/wiki/Numerical_integration">numerical integration</a> using several basic method:
ru: простое веб-приложение для численного интегрирования с использованием нескольких базовых методов:

source: Back
ru: Назад

source: Help
ru: Помощь

source: The function you're goind to integrate should be a function of the only x argument and it should be defined everywhere on the interval of integration.
ru: Подынтегральная функция должна быть функцией единственного аргумента x, всюду определенной на промежутке интегрирования.

source: In the function definition you can use all basic arithmetic operators (+, &minus;, *, /) and some other functions that are listed below:
ru: В определнии функции Вы можете использовать все базовые арифметические операторы (+, &minus;, *, /) и некоторые дополнительные функции, представленные ниже:

source: Wrong input:
ru: Неверный ввод:

source: Integrate
ru: Интегрировать

source: Lower limit:
ru: Нижний предел:

source: Upper limit:
ru: Верхний предел:

source: Number of subintervals:
ru: Число интервалов:

source: type function of x here...
ru: введите функцию от x...

source: all fields should be filled
ru: все поля должны быть заполнены

source: integration limits should be float numbers
ru: пределы интегрирования должны быть вещественными числами

source: number of subintervals should be positive integer
ru: число интервалов должно быть натуральным

source: Home
ru: Главная

source: Source
ru: Исходники

source: Integration Results
ru: Результаты интегрирования

source: Some errors occured while integrating:
ru: В ходе интегрирования возникли некоторые ошибки:

source: Method
ru: Метод

source: Result
ru: Результат
